//1.	什么时候会出现 undefined？

//在变量没有定义初始值的时候会出现undefined

// 2.	什么是数组？什么时候使用？如何创建数组？

//数组是可以储存多个值的变量
//在需要将多个值存到单一变量中使用
//var arr = [值1,值2,值3];


// 3.	如何获取和修改数组中的某一个值？

//获取   数组名[索引]
//修改   数组名[索引] = 值


// 4.	什么是对象？什么时候使用？如何创建对象？

//对象是一种特殊的数据 可以比作现实的物体
//在需要用对象来描述事物的时候使用
// 变量  变量名 = {
//    属性1 : 值1
//    属性2 : 值2
// }


// 5.	如何读取和修改和删除对象中的值？

//变量名.属性名
//变量名.属性名 = 值
//delete 变量名.属性名


// 6.	什么是数据类型？干什么用的？有几种数据类型？

//用来区分每种变量的类型叫数据类型
//用来构建数据结构
//7种
//number
//String
//boolean
//object
//null
//undefined
//symbol


// 7.	Boolean 类型有几个值？分别代表什么？

//有两个值  
//true  代表真
//false 代表假


// 8.	什么时候使用字符串类型？

//在需要输出一串字符的时候使用

// 9.	为变量起名有什么要求？

//变量名区分大小写，允许包含字母、数字、美元符号($)和下划线，第一个字符不允许是数字，不允许包含空格和其他标点符号
//禁止使用JavaScript关键词

// 10.	如何定义常量？常量命名规范?

// const 常量名 = 值
//常量名必须大写 

// 11.	如何定义多行字符串？有几种方法？

// 两种
// 第一种
// console.log("line1\line2\line3");
// 第二种
// console.log('line1
//               line2
//               line3');
