//1. 已知数组{"周兴迟","刘一飞","赵本善","孙妍姿","王妃","陈怡迅"}.
// 请查找出数组中是否有孙妍姿、汪菲。 
// 如果有，请给出索引；
// 如果没有给出-1。


//分析:
//创建方法  在方法中传入姓名
//在方法中 遍历数组元素
//定义变量 如果数组中有这个值  就把这个值赋给变量  如果没有这个值  就赋值-1
//将变量返回
//调用方法 取值




//步骤:
var name1 = "孙妍姿";
var name2 = "汪菲";

//调用方法
console.log(f(name1));
console.log(f(name2));

//创建方法
function f(name){

    //定义数组
    var arr = ["周兴迟","刘一飞","赵本善","孙妍姿","王妃","陈怡迅"];

    //循环遍历数组元素
    for(var i = 0 ; i < arr.length ; i++){

        //定义变量  记录索引
        var count = 0;

        //判断数组元素是否与传入的姓名相等
        if(arr[i] === name){
            //将索引赋值给count
            count = i;
            break;
        }else{
            //将 -1 赋值给count
            count = -1;
        }
    }


        //判断count 是否等于 -1
        if(count == -1){
            //返回 -1
            return -1;
        }else{
            //返回索引
            return count;
    }
}



