//1.打印九九乘法表


//分析
// 先正序 遍历 双层for循环  获取 正序九九乘法表格式
// 再倒序 遍历 双层for循环  获取  倒序的九九乘法表格式




//正序循环遍历 1 到 10
for(var i = 1 ; i < 10 ; i++){
    
    //创建空字符串str
    var str = "";
    //遍历内层循环  str存入表达式格式
    for(var j = 1 ; j <= i ; j++){
        str += i+ '*' + j + '=' + i*j + ' ';
    }
    //打印九九乘法表格式
    console.log(str);
}

//倒序循环遍历 1 到 10
for(var i = 9 ; i >= 1 ; i--){
    
    //创建空字符串str
    var str = "";
    //遍历内层循环  str存入表达式格式
    for(var j = 1 ; j <= i ; j++){
        str += i+ '*' + j + '=' + i*j + ' ';
    }
    //打印九九乘法表格式
    console.log(str);
}
