//5.	5文钱可以买一只公鸡，3文钱可以买一只母鸡，1文钱可以买3只雏鸡。现在用100文钱买100只鸡，那么各有公鸡、母鸡、雏鸡多少只？

//分析
//5x+3y+ z/3 = 100;
//x+y+z = 100;



//取公鸡的范围  公鸡最高为20只  循环遍历公鸡个数  范围在 1-20只
for(var Cman = 1 ; Cman <= 20 ; Cman++){
    
    //取母鸡的范围  母鸡最高为(100 - (Cman * 5)) / 3 只 , 循环遍历母鸡个数
    for(var Cwoman = 0 ; Cwoman <= (100 - (Cman * 5)) / 3 ; Cwoman++){
        //雏鸡的个数为 100 - 公鸡个数 - 母鸡个数 再乘以3
        var Cc = (100- 5 * Cman - 3 * Cwoman) * 3;
        //如果公鸡  母鸡  雏鸡 加起来有100只
        if(Cman + Cwoman + Cc == 100){
            //打印
            console.log("公鸡有: "+Cman+"只 , 母鸡: "+Cwoman+"只 , 小鸡: "+Cc+"只");
        }
    }
}