//7.	大马驮2石粮食，中马驮1石粮食，两头小马驮一石粮食，要用100匹马，驮100石粮食，该如何调配？

//分析
//2x + y + z/2 = 100;
//x + y + z = 100;


//取大马的范围  大马最高为50只  循环遍历大马个数  范围在 1-50只
for(var bigH = 1 ; bigH <= 50 ; bigH++){
    
    //取中马的范围  中马最高为(100 - (Cman * 2)) 只 , 循环遍历中马个数
    for(var medH = 0 ; medH <= (100 - (bigH * 2)) ; medH++){
        //小马的个数为 100 - 大马个数 - 中马个数 再乘以2
        var smaH = (100- 2 * bigH - medH) * 2;
        //如果大马  中马  小马 加起来有100只
        if(bigH + medH + smaH == 100){
            //打印
            console.log("大马 "+bigH+"只 , 中马: "+medH+"只 , 小马: "+smaH+"只");
        }
    }
}
